Diplom1C/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ВКМ_МассовоеСозданиеАктов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВКМ_МассовоеСозданиеАктов</name>
</mdclass:DataProcessor>

Diplom1C/src/AccumulationRegisters/ВКМ_ЗадолженностиКлиентов/ВКМ_ЗадолженностиКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ЗадолженностиКлиентов</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>ВКМ_КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВКМ_Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ВКМ_Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВКМ_Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Diplom1C/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Diplom1C/src/DataProcessors/ВКМ_МассовоеСозданиеАктов/ObjectModule.bsl
#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьРеализацииПоДоговорам(Параметры, АдресРезультата) Экспорт
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВКМ_ЗадолженностиКлиентовОбороты.ВКМ_Договор КАК ВКМ_Договор,
	|	СУММА(ВКМ_ЗадолженностиКлиентовОбороты.ВКМ_СуммаОборот) КАК ВКМ_СуммаОборот
	|ПОМЕСТИТЬ ВТ_Задолженности
	|ИЗ
	|	РегистрНакопления.ВКМ_ЗадолженностиКлиентов.Обороты(&НП, &КП, , ) КАК ВКМ_ЗадолженностиКлиентовОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ЗадолженностиКлиентовОбороты.ВКМ_Договор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Задолженности.ВКМ_Договор КАК ВКМ_Договор,
	|	ЕСТЬNULL(РеализацияТоваровУслуг.Ссылка, НЕОПРЕДЕЛЕНО) КАК ДокументРеализации
	|ИЗ
	|	ВТ_Задолженности КАК ВТ_Задолженности
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	|		ПО ВТ_Задолженности.ВКМ_Договор = РеализацияТоваровУслуг.Договор
	|			И (РеализацияТоваровУслуг.Проведен)
	|ГДЕ
	|	ЕСТЬNULL(РеализацияТоваровУслуг.Ссылка, НЕОПРЕДЕЛЕНО) = НЕОПРЕДЕЛЕНО";
	
	Запрос.УстановитьПараметр("НП", Параметры.ПараметрыВыполнения.Начало);
	Запрос.УстановитьПараметр("КП",Параметры.ПараметрыВыполнения.Окончание);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
				
		ДокументРеализации = Выборка.ДокументРеализации;
		
		Если ДокументРеализации = Неопределено Тогда
			
			ДокументОбъект = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			ДокументОбъект.Дата = Параметры.ПараметрыВыполнения.Окончание;
			ДокументОбъект.Организация =  ВКМ_ПолучитьОрганизацию(); 
			ДокументОбъект.Контрагент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Выборка.ВКМ_Договор, "Владелец"); 
			ДокументОбъект.Договор = Выборка.ВКМ_Договор; 
			
			ДокументОбъект.ВКМ_ВыполнитьАвтозаполнение();
			
			ДокументОбъект.ПроверитьЗаполнение();
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
			
		КонецЕсли;
		
	КонецЦикла; 
			
КонецПроцедуры  

Функция ВКМ_ПолучитьОрганизацию() Экспорт
	
	Организации = Справочники.Организации.Выбрать();
	Пока Организации.Следующий() Цикл
		Возврат Организации.Ссылка;	
	КонецЦикла;
	
КонецФункции

#КонецОбласти
